; domain
(define (domain healthcare)

(:requirements :strips :typing :negative-preconditions :universal-preconditions)

(:types
	location
	unit - locatable
	content - locatable
	box - locatable
	patient - locatable
	robot-box - robot
	robot-patient - robot
	robot - locatable
)

(:constants 
	central_warehouse - location
	entrance - location
	scalpel tongue_depressor aspirin bandage thermometer - content
)

(:predicates
	(at ?x - locatable ?l - location)			; x is at location
	(connected ?l1 - location ?l2 - location)	; locations are connected
	
	(loaded ?r - robot ?b - box)          		; robot is carrying a box
	(unloaded ?r - robot-box)               	; robot is empty
	(empty-box ?b - box)               			; box is empty
	(filled-with ?b - box ?c - content) 		; box is filled with content 
	(unit-has-box ?u - unit ?b - box)           ; unit has a box
	(unit-has-content ?u - unit ?c - content) 	; unit has specific content
	
	(with-patient ?r - robot ?p - patient)     	; robot is with a patient
	(busy ?r - robot-patient)           		; robot is busy with a patient
	(at-unit ?p - patient ?u - unit) 			; patient is at unit
)


; (:functions)


; Both robot-box and robot-patient can move between connected locations
(:action move
	:parameters (?r - robot ?from - location ?to - location)
	:precondition (and 
		(at ?r ?from)
		(or (connected ?from ?to) (connected ?to ?from))
	)
	:effect (and 
		(at ?r ?to)
		(not (at ?r ?from))

		; we don't need to update the location of the carried box or patient
		; it is updated once it is delivered or released
		; (forall (?b - box) 
		; 	(when (loaded ?r ?b) 
		; 		(and (at ?b ?to)
		; 			(not (at ?b ?from))
		; 		)
		; 	)
		; )

		; (forall (?p - patient) 
		; 	(when (with-patient ?r ?p) 
		; 		(and (at ?p ?to)
		; 			(not (at ?p ?from))
		; 		)
		; 	)
		; )
	)
)

; Robot-box can fill a box with content
(:action fill
	:parameters (?r - robot-box ?b - box ?c - content ?l - location)
	:precondition (and 
		(at ?b ?l)
		(at ?r ?l)
		(at ?c ?l)
		(empty-box ?b)
		(= ?l central_warehouse) ; content can only be filled in the central warehouse
	)
	:effect (and 
		(filled-with ?b ?c)
		(not (empty-box ?b))
	)
)

; Robot-box can empty a box filled with content causing the unit to have that content
(:action empty
	:parameters (?r - robot-box ?b - box ?c - content ?u - unit ?l - location)
	:precondition (and 
		(at ?u ?l)
		(at ?b ?l)
		(at ?r ?l)
		(unit-has-box ?u ?b)
		(filled-with ?b ?c)
		; (not (empty-box ?b))					; redundant
		; (not (unit-has-content ?u ?c))			; necessary?
	)
	:effect (and 
		(unit-has-content ?u ?c)
		(not (filled-with ?b ?c))
		(empty-box ?b)
		(at ?c ?l)
	)
)

; Robot-box can pick up a box from a location
(:action pick-up
	:parameters (?r - robot-box ?b - box ?l - location)
	:precondition (and 
		(at ?b ?l)
		(at ?r ?l)
		(unloaded ?r)
	)
	:effect (and 
		(loaded ?r ?b)
		(not (unloaded ?r))
		(not (at ?b ?l))
	)
)


; Robot-box can deliver a box to a unit at a location
(:action deliver
		:parameters (?r - robot-box ?b - box ?l - location ?u - unit)
		:precondition (and
			(at ?r ?l)
			(at ?u ?l)

			(loaded ?r ?b)
		)
		:effect (and 
			(at ?b ?l)
			(unit-has-box ?u ?b)
			
			(not (loaded ?r ?b))
			(unloaded ?r)
		)
)

; Robot-patient can take a patient from a location, causing the robot to be busy
(:action take-patient
	:parameters (?r - robot-patient ?p - patient ?l - location)
	:precondition (and 
		(at ?r ?l)
		(at ?p ?l)
		(not (busy ?r))
	)
	:effect (and 
		(with-patient ?r ?p)
		(busy ?r)
	)
)

; Robot-patient can release a patient at a location, causing the robot to be no longer busy
(:action release-patient
	:parameters (?r - robot-patient ?p - patient ?l - location ?u - unit)
	:precondition (and 
		(at ?r ?l)
		(at ?u ?l)

		(with-patient ?r ?p)
		(busy ?r)
	)

	:effect (and 
		(at ?p ?l)
		(at-unit ?p ?u)
		
		(not (with-patient ?r ?p))
		(not (busy ?r))
	)
)
)

; problem
(define (problem problem1) (:domain healthcare)
(:objects 
    r1 - robot-box
    r2 - robot-patient
    
    b1 b2 b3 b4 b5 b6 b7 b8 - box
    c1 c2 c3 c4 - content

    u1 u2 u3 - unit
    l1 l2 - location

    p1 - patient
)

(:init
    (at b1 central_warehouse)
    (at b2 central_warehouse)
    (at b3 central_warehouse)
    (at b4 central_warehouse)
    (at b5 central_warehouse)
    (at b6 central_warehouse)
    (at b7 central_warehouse)
    (at b8 central_warehouse)

    (empty-box b1)
    (empty-box b2)
    (empty-box b3)
    (empty-box b4)
    (empty-box b5)
    (empty-box b6)
    (empty-box b7)
    (empty-box b8)

    (at tongue_depressor central_warehouse)
    (at scalpel central_warehouse)

    (at c1 central_warehouse)
    (at c2 central_warehouse)
    (at c3 central_warehouse)
    (at c4 central_warehouse)

    (at u1 l1)
    (at u2 l2)
    (at u3 l2)

    (at r1 central_warehouse)
    (at r2 entrance)

    (unloaded r1)
    ; not (busy r2)         not needed, in STRIPS they are false by default if not specified

    (at p1 entrance)
    
    (connected entrance l1)
    (connected l1 l2)
    (connected l2 central_warehouse)
)

(:goal (and
    (unit-has-content u1 c1)
    (unit-has-content u1 c2)
    (unit-has-content u1 c3)
    (unit-has-content u1 c4)
    (unit-has-content u2 c1)
    (unit-has-content u2 c2)
    (unit-has-content u2 c3)
    (unit-has-content u2 c4)

    (at-unit p1 u1)
))

)

; plan
1. (take-patient r2 p1 entrance)
   added: (with-patient r2 p1) (busy r2)
   goals met: 0 of 9
2. (move r2 entrance l1)
   deleted: (at r2 entrance)
   added: (at r2 l1)
   goals met: 0 of 9
3. (release-patient r2 p1 l1 u1)
   deleted: (with-patient r2 p1) (busy r2)
   added: (at p1 l1) (at-unit p1 u1)
   goals met: 1 of 9
4. (fill r1 b8 c1 central_warehouse)
   deleted: (empty-box b8)
   added: (filled-with b8 c1)
   goals met: 1 of 9
5. (pick-up r1 b8 central_warehouse)
   deleted: (unloaded r1) (at b8 central_warehouse)
   added: (loaded r1 b8)
   goals met: 1 of 9
6. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 1 of 9
7. (deliver r1 b8 l2 u2)
   deleted: (loaded r1 b8)
   added: (at b8 l2) (unit-has-box u2 b8) (unloaded r1)
   goals met: 1 of 9
8. (empty r1 b8 c1 u2 l2)
   deleted: (filled-with b8 c1)
   added: (unit-has-content u2 c1) (empty-box b8) (at c1 l2)
   goals met: 2 of 9
9. (move r1 l2 central_warehouse)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 2 of 9
10. (fill r1 b7 c1 central_warehouse)
   deleted: (empty-box b7)
   added: (filled-with b7 c1)
   goals met: 2 of 9
11. (pick-up r1 b7 central_warehouse)
   deleted: (unloaded r1) (at b7 central_warehouse)
   added: (loaded r1 b7)
   goals met: 2 of 9
12. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 2 of 9
13. (move r1 l2 l1)
   deleted: (at r1 l2)
   added: (at r1 l1)
   goals met: 2 of 9
14. (deliver r1 b7 l1 u1)
   deleted: (loaded r1 b7)
   added: (at b7 l1) (unit-has-box u1 b7) (unloaded r1)
   goals met: 2 of 9
15. (empty r1 b7 c1 u1 l1)
   deleted: (filled-with b7 c1)
   added: (unit-has-content u1 c1) (empty-box b7) (at c1 l1)
   goals met: 3 of 9
16. (move r1 l1 l2)
   deleted: (at r1 l1)
   added: (at r1 l2)
   goals met: 3 of 9
17. (move r1 l2 central_warehouse)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 3 of 9
18. (fill r1 b6 c2 central_warehouse)
   deleted: (empty-box b6)
   added: (filled-with b6 c2)
   goals met: 3 of 9
19. (pick-up r1 b6 central_warehouse)
   deleted: (unloaded r1) (at b6 central_warehouse)
   added: (loaded r1 b6)
   goals met: 3 of 9
20. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 3 of 9
21. (deliver r1 b6 l2 u2)
   deleted: (loaded r1 b6)
   added: (at b6 l2) (unit-has-box u2 b6) (unloaded r1)
   goals met: 3 of 9
22. (empty r1 b6 c2 u2 l2)
   deleted: (filled-with b6 c2)
   added: (unit-has-content u2 c2) (empty-box b6) (at c2 l2)
   goals met: 4 of 9
23. (move r1 l2 central_warehouse)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 4 of 9
24. (fill r1 b5 c2 central_warehouse)
   deleted: (empty-box b5)
   added: (filled-with b5 c2)
   goals met: 4 of 9
25. (pick-up r1 b5 central_warehouse)
   deleted: (unloaded r1) (at b5 central_warehouse)
   added: (loaded r1 b5)
   goals met: 4 of 9
26. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 4 of 9
27. (move r1 l2 l1)
   deleted: (at r1 l2)
   added: (at r1 l1)
   goals met: 4 of 9
28. (deliver r1 b5 l1 u1)
   deleted: (loaded r1 b5)
   added: (at b5 l1) (unit-has-box u1 b5) (unloaded r1)
   goals met: 4 of 9
29. (empty r1 b5 c2 u1 l1)
   deleted: (filled-with b5 c2)
   added: (unit-has-content u1 c2) (empty-box b5) (at c2 l1)
   goals met: 5 of 9
30. (move r1 l1 l2)
   deleted: (at r1 l1)
   added: (at r1 l2)
   goals met: 5 of 9
31. (move r1 l2 central_warehouse)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 5 of 9
32. (fill r1 b4 c3 central_warehouse)
   deleted: (empty-box b4)
   added: (filled-with b4 c3)
   goals met: 5 of 9
33. (pick-up r1 b4 central_warehouse)
   deleted: (unloaded r1) (at b4 central_warehouse)
   added: (loaded r1 b4)
   goals met: 5 of 9
34. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 5 of 9
35. (deliver r1 b4 l2 u2)
   deleted: (loaded r1 b4)
   added: (at b4 l2) (unit-has-box u2 b4) (unloaded r1)
   goals met: 5 of 9
36. (empty r1 b4 c3 u2 l2)
   deleted: (filled-with b4 c3)
   added: (unit-has-content u2 c3) (empty-box b4) (at c3 l2)
   goals met: 6 of 9
37. (move r1 l2 central_warehouse)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 6 of 9
38. (fill r1 b3 c3 central_warehouse)
   deleted: (empty-box b3)
   added: (filled-with b3 c3)
   goals met: 6 of 9
39. (fill r1 b2 c4 central_warehouse)
   deleted: (empty-box b2)
   added: (filled-with b2 c4)
   goals met: 6 of 9
40. (pick-up r1 b3 central_warehouse)
   deleted: (unloaded r1) (at b3 central_warehouse)
   added: (loaded r1 b3)
   goals met: 6 of 9
41. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 6 of 9
42. (move r1 l2 l1)
   deleted: (at r1 l2)
   added: (at r1 l1)
   goals met: 6 of 9
43. (deliver r1 b3 l1 u1)
   deleted: (loaded r1 b3)
   added: (at b3 l1) (unit-has-box u1 b3) (unloaded r1)
   goals met: 6 of 9
44. (empty r1 b3 c3 u1 l1)
   deleted: (filled-with b3 c3)
   added: (unit-has-content u1 c3) (empty-box b3) (at c3 l1)
   goals met: 7 of 9
45. (move r1 l1 l2)
   deleted: (at r1 l1)
   added: (at r1 l2)
   goals met: 7 of 9
46. (move r1 l2 central_warehouse)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 7 of 9
47. (pick-up r1 b2 central_warehouse)
   deleted: (unloaded r1) (at b2 central_warehouse)
   added: (loaded r1 b2)
   goals met: 7 of 9
48. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 7 of 9
49. (deliver r1 b2 l2 u2)
   deleted: (loaded r1 b2)
   added: (at b2 l2) (unit-has-box u2 b2) (unloaded r1)
   goals met: 7 of 9
50. (empty r1 b2 c4 u2 l2)
   deleted: (filled-with b2 c4)
   added: (unit-has-content u2 c4) (empty-box b2) (at c4 l2)
   goals met: 8 of 9
51. (move r1 l2 central_warehouse)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 8 of 9
52. (fill r1 b1 c4 central_warehouse)
   deleted: (empty-box b1)
   added: (filled-with b1 c4)
   goals met: 8 of 9
53. (pick-up r1 b1 central_warehouse)
   deleted: (unloaded r1) (at b1 central_warehouse)
   added: (loaded r1 b1)
   goals met: 8 of 9
54. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 8 of 9
55. (move r1 l2 l1)
   deleted: (at r1 l2)
   added: (at r1 l1)
   goals met: 8 of 9
56. (deliver r1 b1 l1 u1)
   deleted: (loaded r1 b1)
   added: (at b1 l1) (unit-has-box u1 b1) (unloaded r1)
   goals met: 8 of 9
57. (empty r1 b1 c4 u1 l1)
   deleted: (filled-with b1 c4)
   added: (unit-has-content u1 c4) (empty-box b1) (at c4 l1)
   goals met: 9 of 9
